#+STARTUP: hideblocks

* Router.js
:PROPERTIES: 
:header-args: :tangle ~/mnt/Streamer2.0/router.js :mkdirp yes
:END:
  
The router is responisple for "routing" requests to the right resources.
If a user request's something wia URL, it will be routed through the router
and handled with the appropriate ~requestHandler~.

A list of modules that will be used in Router.js.  
The modules are essential pieces of code that gives the router the capabilities
to do what it needs to do!

#+NAME Modules
#+BEGIN_SRC js
var fs = require('fs');
var requestHandlers = require('./streamer.js');
var path = require('path');
var url = require('url');
#+END_SRC

The requesthandler is an array of functions that is imported from the module
~streamer.js~. The requestHandler functions has the same name as URL's, and we execute
the following functions depending on what URL has been requested. 

#+NAME Requesthandlers
#+BEGIN_SRC js
var handle = {};
handle['/'] = requestHandlers.index;
handle['/streaming'] = requestHandlers.video;
handle['/ajax'] = requestHandlers.ajax;
handle['/getResource'] = requestHandlers.getResource;
handle['/listEntry'] = requestHandlers.getEntries;
/*<================****===============> */
handle['public'] = requestHandlers.public;

#+END_SRC

The module Router will be exported to the Server. 
#+NAME Router
#+BEGIN_SRC js
var router = function(res, req){

// url_parts will contain the different sections of the requested URL. like the protocol, the href, slashes, etc.
// parts will contain the "data", like the &=?. All the "name" variables in HTML will be found in parts, e.o from Forms, etc.
var url_parts = url.parse(req.url,true);
var parts = url_parts.query;

console.log("requestin: " + url_parts.pathname);
console.log("Data: " + parts.intext);
    try {
       
        // if the url PATH is the same name as a function, we will execute that function with the URL parts.
        if (typeof handle[url_parts.pathname] === 'function') {
            handle[url_parts.pathname](res,req,parts);

         }else{
            var dirname = path.dirname(decodeURI(req.url));
            var basename = path.basename(decodeURI(req.url));
            var fullPath = path.resolve(dirname,basename);
            fullPath = "." + fullPath; 
            console.log(fullPath);
            
            handle['public'](res, fullPath);
         }           
    }
        catch(err) {
            
            console.log(err);
        }

}

//Exports the "router" as a module for Server.js
exports.router = router
#+END_SRC























#+begin_src js :results output
  console.log("heeeyyyyyJA.OHOH!");

  console.log("I am running inside a source block, bebbeh!");
#+end_src

#+RESULTS:
: heeeyyyyyJA.OHOH!
: I am running inside a source block, bebbeh!

#+begin_src js :results value
  console.log("heeeyyyyyJA.OHOH!");

  console.log("I am running inside a source block, bebbeh!");
#+end_src

#+RESULTS:
: heeeyyyyyJA.OHOH!
: I am running inside a source block, bebbeh!
: undefined


#+begin_src js :results session
  console.log("heeeyyyyyJA.OHOH!");
  var k = 0;
  for(var i = 0; i < 10; i++) {
      k+=i; 
  }
  console.log(k);
  console.log("I am running inside a source block, bebbeh!");
#+end_src

#+RESULTS:
: heeeyyyyyJA.OHOH!
: 45
: I am running inside a source block, bebbeh!
: undefined

#+RESULTS:

:exports code
The default in most languages. The body of the code block is exported, as described in Literal examples. 
:exports results
The code block will be evaluated each time to buffer is exported, and the results will be placed in the Org mode buffer for export, either updating previous results of the code block located anywhere in the buffer or, if no previous results exist, placing the results immediately after the code block. The body of the code block will not be exported. 
:exports both
Both the code block and its results will be exported. 
:exports none
Neither the code bloc 
